In [287]:
import numpy as np 
import pandas as pd

In [288]:
dict1 = {
    "name":['alice','bob','charlie','david','eva'],
    "marks":[85,92,78,90,88],
    "city":['new york','los angeles','chicago','houston','phoenix']
}

In [289]:
df = pd.DataFrame(dict1)
df

      name  marks         city
0    alice     85     new york
1      bob     92  los angeles
2  charlie     78      chicago
3    david     90      houston
4      eva     88      phoenix

In [290]:
#convert it into csv file
df.to_csv("test1.csv")

In [291]:
df.to_csv("test1_no_index.csv",index=False)

In [292]:
df.head()

      name  marks         city
0    alice     85     new york
1      bob     92  los angeles
2  charlie     78      chicago
3    david     90      houston
4      eva     88      phoenix

In [293]:
df.head(3)

      name  marks         city
0    alice     85     new york
1      bob     92  los angeles
2  charlie     78      chicago

In [294]:
df.tail(2)

    name  marks     city
3  david     90  houston
4    eva     88  phoenix

In [295]:
df.describe()

           marks
count   5.000000
mean   86.600000
std     5.458938
min    78.000000
25%    85.000000
50%    88.000000
75%    90.000000
max    92.000000

In [296]:
try1 = pd.read_csv("test1_no_index.csv")

In [297]:
try1

      name  marks         city
0    alice     85     new york
1      bob     92  los angeles
2  charlie     78      chicago
3    david     90      houston
4      eva     88      phoenix

In [298]:
try1['city'][3] = 'san francisco'

C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\140816588.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  try1['city'][3] = 'san francisco'
C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\140816588.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  try1['city'][3] = 'san francisco'

In [299]:
try1

      name  marks           city
0    alice     85       new york
1      bob     92    los angeles
2  charlie     78        chicago
3    david     90  san francisco
4      eva     88        phoenix

In [300]:
try1.index = ['i','ii','iii','iv','v']

In [301]:
try1

        name  marks           city
i      alice     85       new york
ii       bob     92    los angeles
iii  charlie     78        chicago
iv     david     90  san francisco
v        eva     88        phoenix

In [302]:
ser = pd.Series(np.random.rand(30))

In [303]:
type(ser)

pandas.core.series.Series

In [304]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [305]:
type(newdf)

pandas.core.frame.DataFrame

In [306]:
newdf.describe() ## gives the statistical summary

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.510176    0.485761    0.490240    0.484922    0.527598
std      0.281462    0.291130    0.287969    0.282384    0.282648
min      0.001614    0.012299    0.005286    0.002967    0.003963
25%      0.284926    0.217832    0.234933    0.233454    0.273969
50%      0.516085    0.497062    0.483839    0.483234    0.531880
75%      0.769618    0.744088    0.727774    0.714154    0.767319
max      0.998536    0.999563    0.998895    0.992888    0.994879

In [307]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [308]:
newdf[0][0] = "strings"

C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\1791853862.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "strings"
C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\1791853862.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'strings' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "strings"

In [309]:
newdf.head()

          0         1         2         3         4
0   strings  0.647220  0.331055  0.772805  0.621193
1  0.342485  0.618160  0.024906  0.179171  0.693653
2  0.754632  0.625227  0.928468  0.346348  0.800945
3  0.970009  0.924394  0.952210  0.631154  0.970552
4  0.556086  0.547303  0.086793  0.465932  0.735879

In [310]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [311]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [312]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [313]:
newdf.to_numpy()

array([['strings', 0.6472203103555491, 0.3310546902671876,
        0.7728049749931762, 0.6211931485060852],
       [0.34248498996352184, 0.6181603852627148, 0.024905795172946332,
        0.17917096430338386, 0.693652631492506],
       [0.7546321410447603, 0.6252269343667006, 0.9284676787317765,
        0.3463476052357163, 0.8009446569945502],
       ...,
       [0.3698526905677153, 0.05814835018715614, 0.33273210642407014,
        0.671095750202842, 0.8325094132504266],
       [0.8976266990121086, 0.5791824921570691, 0.34361947847063457,
        0.5858329841062196, 0.6967778633334795],
       [0.3889070398755269, 0.601454451919648, 0.7881047410763381,
        0.4895525643810621, 0.4407700489035743]],
      shape=(334, 5), dtype=object)

In [314]:
newdf.T ##transpose columns to rows and vice versa

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,strings,0.342485,0.754632,0.970009,0.556086,0.943937,0.389922,0.870991,0.441174,0.345013,...,0.526051,0.313802,0.504224,0.506766,0.251695,0.149435,0.738553,0.369853,0.897627,0.388907
1,0.64722,0.61816,0.625227,0.924394,0.547303,0.636407,0.059566,0.859126,0.422214,0.18954,...,0.461925,0.396224,0.635506,0.814247,0.091005,0.142318,0.313807,0.058148,0.579182,0.601454
2,0.331055,0.024906,0.928468,0.95221,0.086793,0.203023,0.200456,0.613088,0.355681,0.347496,...,0.263198,0.817659,0.031757,0.930399,0.752934,0.293067,0.372805,0.332732,0.343619,0.788105
3,0.772805,0.179171,0.346348,0.631154,0.465932,0.127503,0.913669,0.408461,0.170442,0.102301,...,0.176104,0.985631,0.43221,0.803773,0.490694,0.776883,0.244155,0.671096,0.585833,0.489553
4,0.621193,0.693653,0.800945,0.970552,0.735879,0.625314,0.772985,0.37013,0.982342,0.332038,...,0.475981,0.726311,0.654191,0.404768,0.207753,0.161288,0.239564,0.832509,0.696778,0.44077

In [315]:
newdf.sort_index(axis=0, ascending=False)
## axis '0' means rows and '1' means columns

            0         1         2         3         4
333  0.388907  0.601454  0.788105  0.489553  0.440770
332  0.897627  0.579182  0.343619  0.585833  0.696778
331  0.369853  0.058148  0.332732  0.671096  0.832509
330  0.738553  0.313807  0.372805  0.244155  0.239564
329  0.149435  0.142318  0.293067  0.776883  0.161288
..        ...       ...       ...       ...       ...
4    0.556086  0.547303  0.086793  0.465932  0.735879
3    0.970009  0.924394  0.952210  0.631154  0.970552
2    0.754632  0.625227  0.928468  0.346348  0.800945
1    0.342485  0.618160  0.024906  0.179171  0.693653
0     strings  0.647220  0.331055  0.772805  0.621193

[334 rows x 5 columns]

In [316]:
newdf.sort_index(axis=1, ascending= False)

            4         3         2         1         0
0    0.621193  0.772805  0.331055  0.647220   strings
1    0.693653  0.179171  0.024906  0.618160  0.342485
2    0.800945  0.346348  0.928468  0.625227  0.754632
3    0.970552  0.631154  0.952210  0.924394  0.970009
4    0.735879  0.465932  0.086793  0.547303  0.556086
..        ...       ...       ...       ...       ...
329  0.161288  0.776883  0.293067  0.142318  0.149435
330  0.239564  0.244155  0.372805  0.313807  0.738553
331  0.832509  0.671096  0.332732  0.058148  0.369853
332  0.696778  0.585833  0.343619  0.579182  0.897627
333  0.440770  0.489553  0.788105  0.601454  0.388907

[334 rows x 5 columns]

In [317]:
newdf2 = newdf.copy()

In [318]:
newdf2[0][0] = 25688

C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\486836105.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 25688
C:\Users\Bhuvana P\AppData\Local\Temp\ipykernel_1860\486836105.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 25688

In [319]:
newdf.head()

          0         1         2         3         4
0   strings  0.647220  0.331055  0.772805  0.621193
1  0.342485  0.618160  0.024906  0.179171  0.693653
2  0.754632  0.625227  0.928468  0.346348  0.800945
3  0.970009  0.924394  0.952210  0.631154  0.970552
4  0.556086  0.547303  0.086793  0.465932  0.735879

In [320]:
newdf2.head()

          0         1         2         3         4
0     25688  0.647220  0.331055  0.772805  0.621193
1  0.342485  0.618160  0.024906  0.179171  0.693653
2  0.754632  0.625227  0.928468  0.346348  0.800945
3  0.970009  0.924394  0.952210  0.631154  0.970552
4  0.556086  0.547303  0.086793  0.465932  0.735879

In [321]:
newdf.loc[0,0] = 123

In [322]:
newdf.head(2)

          0        1         2         3         4
0       123  0.64722  0.331055  0.772805  0.621193
1  0.342485  0.61816  0.024906  0.179171  0.693653

In [323]:
newdf.columns = list('ABCDE')

In [324]:
newdf.head(2)

          A        B         C         D         E
0       123  0.64722  0.331055  0.772805  0.621193
1  0.342485  0.61816  0.024906  0.179171  0.693653

In [325]:
newdf.loc[0,0] = 25697

In [326]:
newdf.head(2)

          A        B         C         D         E        0
0       123  0.64722  0.331055  0.772805  0.621193  25697.0
1  0.342485  0.61816  0.024906  0.179171  0.693653      NaN

In [327]:
newdf = newdf.drop(0,axis = 1)

In [328]:
newdf.head(2)

          A        B         C         D         E
0       123  0.64722  0.331055  0.772805  0.621193
1  0.342485  0.61816  0.024906  0.179171  0.693653

In [329]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.024906  0.179171
2  0.928468  0.346348

In [330]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.342485  0.618160  0.024906  0.179171  0.693653
2  0.754632  0.625227  0.928468  0.346348  0.800945

In [331]:
newdf.loc[:,['C','D']]

            C         D
0    0.331055  0.772805
1    0.024906  0.179171
2    0.928468  0.346348
3    0.952210  0.631154
4    0.086793  0.465932
..        ...       ...
329  0.293067  0.776883
330  0.372805  0.244155
331  0.332732  0.671096
332  0.343619  0.585833
333  0.788105  0.489553

[334 rows x 2 columns]

In [332]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
18   0.250705  0.565158  0.693209  0.015100  0.250354
23   0.216907  0.904566  0.366805  0.919200  0.787621
24   0.138424  0.772221  0.165111  0.363394  0.272032
27   0.196146  0.043296  0.440241  0.571896  0.759864
29   0.072952  0.770548  0.539656  0.273114  0.588059
..        ...       ...       ...       ...       ...
318  0.281091  0.752526  0.943534  0.794772  0.587335
319   0.24862  0.565611  0.509977  0.624373  0.098396
320  0.011243  0.180686  0.404262  0.689712  0.461454
328  0.251695  0.091005  0.752934  0.490694  0.207753
329  0.149435  0.142318  0.293067  0.776883  0.161288

[85 rows x 5 columns]

In [333]:
newdf.iloc[0,4]

np.float64(0.6211931485060852)

In [334]:
newdf.iloc[[0,1],[1,2]]

         B         C
0  0.64722  0.331055
1  0.61816  0.024906

In [335]:
newdf.drop(['A','D'],axis=1,inplace=True)
## inplace = True -> modifies the existing dataframe without creating a new one

In [337]:
newdf.drop([1,5],axis=0,inplace=True)

In [340]:
newdf.head()

          B         C         E
0  0.647220  0.331055  0.621193
2  0.625227  0.928468  0.800945
3  0.924394  0.952210  0.970552
4  0.547303  0.086793  0.735879
6  0.059566  0.200456  0.772985

In [343]:
newdf.reset_index(drop=True, inplace = True)

In [345]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [ ]:
newdf.loc[:,['B']] = 35

In [350]:
newdf.head()

      B         C         E
0  None  0.331055  0.621193
1  None  0.928468  0.800945
2  None  0.952210  0.970552
3  None  0.086793  0.735879
4  None  0.200456  0.772985

In [349]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [355]:
df = pd.DataFrame({"name":['alfred','berta','alfred'],
"toy":[np.nan,'batmobile','bullwhip'],
"born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]})

In [356]:
df.head()

     name        toy       born
0  alfred        NaN        NaT
1   berta  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [357]:
df.dropna(how = "all")

     name        toy       born
0  alfred        NaN        NaT
1   berta  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [362]:
df.drop_duplicates(subset=['name'], keep='last')
##keep = 'first' / 'last' / False -> first occurrence, last occurrence, drop all duplicates

     name        toy       born
1   berta  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [364]:
df.shape

(3, 3)

In [365]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [367]:
df['name'].value_counts(dropna=False)

name
alfred    2
berta     1
Name: count, dtype: int64

In [368]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [369]:
df1 = pd.DataFrame(np.random.rand(3,2))

In [370]:
df1

          0         1
0  0.027900  0.131848
1  0.958639  0.861160
2  0.571301  0.327457

In [371]:
df1.describe()

              0         1
count  3.000000  3.000000
mean   0.519280  0.440155
std    0.467545  0.377492
min    0.027900  0.131848
25%    0.299601  0.229652
50%    0.571301  0.327457
75%    0.764970  0.594308
max    0.958639  0.861160

In [372]:
df1.mean()

0    0.519280
1    0.440155
dtype: float64

In [373]:
df1.corr()

         0        1
0  1.00000  0.93659
1  0.93659  1.00000

In [375]:
df1.max()

0    0.958639
1    0.861160
dtype: float64

In [376]:
df1.count()

0    3
1    3
dtype: int64

In [378]:
df1.min()

0    0.027900
1    0.131848
dtype: float64

In [379]:
df1.median()

0    0.571301
1    0.327457
dtype: float64

In [380]:
df1.std()

0    0.467545
1    0.377492
dtype: float64